# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Crée un dataframe "fruit" qui reproduit l'image ci-dessus à l'aide en utilisant une liste

In [0]:
import pandas as pd

data1 = {'Apples': [30], 'Bananas': [21]}

fruit = pd.DataFrame(data = data1)

fruit

   Apples  Bananas
0      30       21

# Mission 2

Crée un dataframe "fruits_vendus" qui reproduit l'image ci-dessous en utilisant un dictionnaire

![](https://i.imgur.com/CHPn7ZF.png)

In [0]:
data2 = {'Apples':[35,41], 'Bananas':[21,34]}

fruits_vendus = pd.DataFrame(data2, index=['2017 Sales','2018 Sales'])

fruits_vendus

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

# Mission 3

Renomme les noms de colonnes du dataframe de la mission 2 en français

In [0]:
fruits_vendus.rename(columns = {'Apples':'Pommes', 'Bananas':'Bananes'})

fruits_vendus

            Pommes  Bananes
2017 Sales      35       21
2018 Sales      41       34

# Mission 4

Utilise une boucle pour afficher les valeurs des colonnes du dataframe de la mission 3

In [0]:
for index, row in fruits_vendus.iterrows():
  print(row['Pommes'], row['Bananes'])

35 21
41 34

# Mission 5

Supprime la ligne 1 du dataframe de la mission 3

In [0]:
fruits_vendus.drop(['2017 Sales'])

            Pommes  Bananes
2018 Sales      41       34

# Mission 6

Supprime une colonne du dataframe de la mission 3

In [0]:
fruits_vendus.drop('Pommes', axis=1)

            Bananes
2017 Sales       21
2018 Sales       34